jsalazizzle/SmartHandle/James.cydsn/Generated_Source/PSoC6/pdl/bootloader/cy_bootload.h
#define CY_BOOTLOAD_IOCTL_BHP           (0x02u) /**< Data from/to Bootloader Host. It may require decryption */

/** \} group_bootload_macro_ioctl */

/**
* \defgroup group_bootload_macro_response_size Response Size
* \{
*/

#define CY_BOOTLOAD_RSP_SIZE_0          (0u)    /**< Data size for most bootloader commands responses */
#define CY_BOOTLOAD_RSP_SIZE_VERIFY_APP (1u)    /**< Data size for 'Verify Application' bootloader command response */

/** \} group_bootload_macro_response_size */

/** Bootloader SDK PDL ID */
#define CY_BOOTLOAD_ID                  CY_PDL_DRV_ID(0x06u)


/**
* \defgroup group_bootload_macro_app_type Application types
* \{
* Used to define what application format is expected.
*/
#define CY_BOOTLOAD_BASIC_APP           (0u)    /**< Application format for non-secure applications */
#define CY_BOOTLOAD_CYPRESS_APP         (1u)    /**< Cypress Standard User Application format */
#define CY_BOOTLOAD_SIMPLIFIED_APP      (2u)    /**< Simplified User Application Object format */
/** \} group_bootload_macro_app_type */

/**
* \defgroup group_bootload_macro_ver_type Types of secure application verification
* \{
* Used to define what type of secure application verification is expected.
*/
#define CY_BOOTLOAD_VERIFY_FAST         (0u)    /**< Verification includes only application check*/
#define CY_BOOTLOAD_VERIFY_FULL         (1u)    /**< Verification includes application, key, and TOC checks */
/** \} group_bootload_macro_ver_type */

/** \} group_bootload_macro */

/**
* \addtogroup group_bootload_data_structs
* \{
*/

/** Working parameters for some Bootloader SDK APIs. */
typedef struct
{
    /**
    * The pointer to a buffer that keeps data to read or write to an NVM.
    * It is required to be 4-byte aligned.
    */
    uint8_t  *dataBuffer;
    uint32_t  dataOffset;   /**< Offset within \c dataBuffer to put next chunk of data */
    /**
    * The pointer to a buffer that keeps packets sent and received with the Transport API.
    * It is required to be 4-byte aligned.
    */
    uint8_t  *packetBuffer;
    uint32_t  timeout;      /**< The timeout value in milliseconds */
    uint32_t  appId;        /**< Set with the Set App Metadata bootloader command.
                            *    Used to determine an appId of bootloaded image  */
    uint32_t  appVerified;  /**< Internal, flags if Verify Application is called before Exit */
    
    /**
    * The initial value to the ctl parameter for
    * \ref Cy_Bootload_ReadData and \ref Cy_Bootload_WriteData.
    * The Bootloader SDK functions call Read/Write Data functions like this: \n
    * Cy_Bootload_ReadData(addr, length, CY_BOOTLOAD_IOCTL_COMPARE, params).
    */
    uint32_t  initCtl;
    
#if CY_BOOTLOAD_OPT_SET_EIVECTOR != 0
    /**
    * The pointer to an Encryption Initialization Vector buffer.
    * Must be 0-, 8-, or 16-byte long and 4-byte aligned.
    * This may be used in \ref Cy_Bootload_ReadData and \ref Cy_Bootload_WriteData
    * to encrypt or decrypt data when the CY_BOOTLOAD_IOCTL_BHP flag is set in the
    * ctl parameter.
    */
    uint8_t *encryptionVector;
#endif /* CY_BOOTLOAD_OPT_SET_EIVECTOR != 0 */
    
} cy_stc_bootload_params_t;

/**
* Only used inside BootloaderCommand_Enter().
* \note A public definition because the user may want to redefine 
* the bootloader packet.
*/
typedef struct
{
    uint32_t enterSiliconId;             /**< The silicon ID for a device */
    uint8_t  enterRevision;              /**< Silicon Revision for a device */
    uint8_t  enterBootloaderVersion[3];  /**< The Bootloader SDK version */
} cy_stc_bootload_enter_t;
/** \} group_bootload_data_structs */

/**
* \addtogroup group_bootload_enums
* \{
*/

/** Used to return the statuses of most Bootloader SDK APIs */
typedef enum
{
    /** Correct status, No error */
    CY_BOOTLOAD_SUCCESS         =                                        0x00u,
    /** Verification failed */
    CY_BOOTLOAD_ERROR_VERIFY    = CY_BOOTLOAD_ID | CY_PDL_STATUS_ERROR | 0x02u,
    /** The length of received packet is outside of expected range */
    CY_BOOTLOAD_ERROR_LENGTH    = CY_BOOTLOAD_ID | CY_PDL_STATUS_ERROR | 0x03u,
    /** The data in the received packet is invalid */
    CY_BOOTLOAD_ERROR_DATA      = CY_BOOTLOAD_ID | CY_PDL_STATUS_ERROR | 0x04u,
    /** Command is not recognized */
    CY_BOOTLOAD_ERROR_CMD       = CY_BOOTLOAD_ID | CY_PDL_STATUS_ERROR | 0x05u,
    /** checksum does not match the expected value */
    CY_BOOTLOAD_ERROR_CHECKSUM  = CY_BOOTLOAD_ID | CY_PDL_STATUS_ERROR | 0x08u,
    /** Wrong address */
    CY_BOOTLOAD_ERROR_ADDRESS   = CY_BOOTLOAD_ID | CY_PDL_STATUS_ERROR | 0x0Au,
    /** Command timed out */
    CY_BOOTLOAD_ERROR_TIMEOUT   = CY_BOOTLOAD_ID | CY_PDL_STATUS_ERROR | 0x40u,
    /** Unknown bootloader error, this shall not happen */
    CY_BOOTLOAD_ERROR_UNKNOWN   = CY_BOOTLOAD_ID | CY_PDL_STATUS_ERROR | 0x0Fu
} cy_en_bootload_status_t;


/** \} group_bootload_enums */

/**
* \addtogroup group_bootload_globals
* \{
*/

/**
* \defgroup group_bootload_globals_external_elf_symbols External ELF file symbols
* \{
* These symbols are added to the generated ELF file. \n
* Their values are either defined in the linker script (GCC, IAR)
* or in an assembly code (MDK).
* They may be used by CyMCUElfTool as parameters for generating a CYACD2 file.
* Also, the Bootloader SDK APIs may user them to refer link-time known values
* to the compile time.
*/
extern uint8_t __cy_boot_metadata_addr;     /**< Metadata address           */
extern uint8_t __cy_boot_metadata_length;   /**< Metadata row size          */
extern uint8_t __cy_product_id;             /**< Product ID                 */
extern uint8_t __cy_checksum_type;          /**< Checksum Algorithm for BHP */
extern uint8_t __cy_app_id;                 /**< Current application number */
extern uint8_t __cy_app_core1_start_addr;   /**< core1 vector table address, if present */
/** \} group_bootload_globals_external_elf_symbols */

