jsalazizzle/SmartHandle/James.cydsn/Generated_Source/PSoC6/pdl/bootloader/cy_bootload.h
/** \} group_bootload_globals */

/**
* \addtogroup group_bootload_functions
* \{
*/

cy_en_bootload_status_t Cy_Bootload_DoBootload(uint32_t *state, uint32_t timeout);
cy_en_bootload_status_t Cy_Bootload_Init(uint32_t *state, cy_stc_bootload_params_t *params);
cy_en_bootload_status_t Cy_Bootload_Continue(uint32_t *state, cy_stc_bootload_params_t *params);

void Cy_Bootload_ExecuteApp(uint32_t appId);
cy_en_bootload_status_t Cy_Bootload_SwitchToApp(uint32_t appId);

uint32_t Cy_Bootload_DataChecksum(const uint8_t *address, uint32_t length, cy_stc_bootload_params_t *params);
cy_en_bootload_status_t Cy_Bootload_ValidateMetadata(uint32_t metadataAddress, cy_stc_bootload_params_t *params);
cy_en_bootload_status_t Cy_Bootload_ValidateApp(uint32_t appId, cy_stc_bootload_params_t *params);

uint32_t Cy_Bootload_GetRunningApp(void);

cy_en_bootload_status_t Cy_Bootload_GetAppMetadata(uint32_t appId, uint32_t *verifyAddress, uint32_t *verifySize);

#if CY_BOOTLOAD_METADATA_WRITABLE != 0
    cy_en_bootload_status_t Cy_Bootload_SetAppMetadata(uint32_t appId, uint32_t verifyAddress,
                                                       uint32_t verifySize, cy_stc_bootload_params_t *params);
#endif /* if CY_BOOTLOAD_METADATA_WRITABLE != 0 */

cy_en_bootload_status_t Cy_Bootload_CopyApp(uint32_t destAddress, uint32_t srcAddress, uint32_t length,
                                            uint32_t rowSize, cy_stc_bootload_params_t *params);

void Cy_Bootload_OnResetApp0(void);

/* These 2 IO functions have to be re-implemented in the user's code */
cy_en_bootload_status_t Cy_Bootload_ReadData (uint32_t address, uint32_t length, uint32_t ctl, 
                                              cy_stc_bootload_params_t *params);
cy_en_bootload_status_t Cy_Bootload_WriteData(uint32_t address, uint32_t length, uint32_t ctl, 
                                              cy_stc_bootload_params_t *params);

/* These 5 communication functions have to be re-implemented in the user's code */
cy_en_bootload_status_t Cy_Bootload_TransportRead (uint8_t buffer[], uint32_t size, uint32_t *count, uint32_t timeout);
cy_en_bootload_status_t Cy_Bootload_TransportWrite(uint8_t buffer[], uint32_t size, uint32_t *count, uint32_t timeout);
void Cy_Bootload_TransportReset(void);
void Cy_Bootload_TransportStart(void);
void Cy_Bootload_TransportStop(void);


/** \} group_bootload_functions */

#ifdef __cplusplus
}
#endif

#endif /* !defined(CY_BOOTLOAD_H) */


/* [] END OF FILE */
